-- MySQL dump 10.13  Distrib 8.0.45, for Linux (x86_64)
--
-- Host: localhost    Database: allstarvintage
-- ------------------------------------------------------
-- Server version	8.0.45

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `players`
--

DROP TABLE IF EXISTS `players`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `players` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `team_id` bigint unsigned NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `number` int NOT NULL,
  `gender` enum('Α','Γ') COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `players_team_id_foreign` (`team_id`),
  CONSTRAINT `players_team_id_foreign` FOREIGN KEY (`team_id`) REFERENCES `teams` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=123 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `players`
--

LOCK TABLES `players` WRITE;
/*!40000 ALTER TABLE `players` DISABLE KEYS */;
INSERT INTO `players` VALUES (1,1,'Μαργαρίτης Γιάννης',2,'Α','2026-04-28 13:17:25','2026-04-28 13:17:25'),(3,1,'Βεργιαννάκης Γιάννης',7,'Α','2026-04-28 13:18:06','2026-04-28 13:18:06'),(4,1,'Κολιαβασίλη Κασσάνδρα',10,'Γ','2026-04-28 13:18:27','2026-04-28 13:18:27'),(5,1,'Ταμπουρατζής Νίκος',23,'Α','2026-04-28 13:18:44','2026-04-28 13:18:44'),(6,1,'Καραγιώργος Δημήτρης',14,'Α','2026-04-28 13:19:01','2026-04-28 13:19:01'),(7,1,'Πολίτο Φλώρα',19,'Γ','2026-04-28 13:19:18','2026-04-28 13:19:18'),(8,1,'Ρούβας Νίκος',46,'Α','2026-04-28 13:19:35','2026-04-28 13:19:35'),(9,1,'Κούρος Ηλίας',11,'Α','2026-04-28 13:19:48','2026-04-28 13:19:48'),(10,1,'Σακελλαρίου Δημήτρης',12,'Α','2026-04-28 13:20:06','2026-04-28 13:20:06'),(11,1,'Προκοπίου Ελεάνα',22,'Γ','2026-04-28 13:20:28','2026-04-28 13:20:28'),(12,1,'Sergio',25,'Α','2026-04-28 13:20:38','2026-04-28 13:20:38'),(13,2,'Πανταζίδης Ανέστης',4,'Α','2026-04-28 13:25:05','2026-04-28 13:25:05'),(16,2,'Σταύρου Μαρία',9,'Γ','2026-04-28 13:26:19','2026-04-28 13:26:19'),(17,2,'Ασίκης Αθανάσιος',1,'Α','2026-04-28 13:26:35','2026-04-28 13:26:35'),(18,2,'Μπούκης Χριστόδουλος',67,'Α','2026-04-28 13:26:53','2026-04-28 13:26:53'),(19,2,'Καρναμπάκος Γιώργος',15,'Α','2026-04-28 13:27:09','2026-04-28 13:27:09'),(20,2,'Τσιούμας Δημήτρης',18,'Α','2026-04-28 13:27:33','2026-04-28 13:27:33'),(21,2,'Γεωργοσόπουλος Νίκος',21,'Α','2026-04-28 13:28:18','2026-04-28 13:28:18'),(22,2,'Τζούλας Παναγιώτης',77,'Α','2026-04-28 13:28:39','2026-04-28 13:28:39'),(24,2,'Δανέζης Γιάννης',13,'Α','2026-04-28 13:29:30','2026-04-28 13:29:30'),(25,2,'Κολιαβασίλη Μαρία',6,'Γ','2026-04-28 13:36:15','2026-04-28 13:36:15'),(26,2,'Κολιαβασίλη Σοφία',8,'Γ','2026-04-28 13:36:34','2026-04-28 13:36:34'),(27,2,'Χουχούλη Σταυρούλα',5,'Γ','2026-04-28 13:37:56','2026-04-28 13:37:56'),(28,1,'Λυμπεροπούλου Έφη',3,'Γ','2026-04-30 11:21:03','2026-04-30 11:21:03'),(29,4,'Βαλογιάννη Ήλια',1,'Γ','2026-04-30 13:08:17','2026-04-30 13:08:17'),(30,4,'Μπούζα Μπριτζίλντα',12,'Γ','2026-04-30 13:48:02','2026-04-30 13:49:06'),(32,4,'Οικονόμου Παρασκευή',10,'Γ','2026-04-30 13:49:35','2026-04-30 13:49:35'),(33,4,'Μήτσα Βασιλική',9,'Γ','2026-04-30 13:50:03','2026-04-30 13:50:03'),(35,4,'Χατζηαντωνίου Βασίλης',7,'Α','2026-04-30 13:51:21','2026-04-30 13:51:21'),(36,4,'Λίτσας Βάσης',8,'Α','2026-04-30 13:51:39','2026-04-30 13:51:39'),(37,4,'Βόντας Σεβαστιανός',24,'Α','2026-04-30 13:51:58','2026-04-30 13:51:58'),(38,4,'Δημητριάδης Στέφανος',23,'Α','2026-04-30 13:52:20','2026-04-30 13:52:20'),(39,4,'Τσάιμος Ελευθέριος',4,'Α','2026-04-30 13:52:36','2026-04-30 13:52:36'),(40,4,'Κολιάκης Ελευθέριος',18,'Α','2026-04-30 13:52:56','2026-04-30 13:52:56'),(41,4,'Σιούντας Περικλής',52,'Α','2026-04-30 13:53:12','2026-04-30 13:53:12'),(42,3,'Αλεξανδροπούλου Παυλίνα',2,'Γ','2026-05-01 06:35:20','2026-05-01 06:35:20'),(43,3,'Γκιζώρη Κωνσταντίνα',4,'Γ','2026-05-01 06:35:40','2026-05-01 06:35:40'),(44,3,'Πρέκα Ιωάννα',7,'Γ','2026-05-01 06:35:57','2026-05-01 06:35:57'),(45,3,'Καραβαράκης Στράτος',8,'Α','2026-05-01 06:36:15','2026-05-01 06:36:15'),(46,3,'Κωστόπουλος Μιχάλης',9,'Α','2026-05-01 06:36:31','2026-05-01 06:36:31'),(47,3,'Παπαδόπουλος Δηµήτρης',10,'Α','2026-05-01 06:36:48','2026-05-01 06:36:48'),(48,3,'Μαστρογιάννης Γιώργος',11,'Α','2026-05-01 06:37:00','2026-05-01 06:37:00'),(49,3,'Χριστοφίλη Ελένη',13,'Γ','2026-05-01 06:37:23','2026-05-01 06:37:23'),(50,3,'Βασιλόπουλος Στέφανος',15,'Α','2026-05-01 06:37:47','2026-05-01 06:37:47'),(51,3,'Νίκος Τηλιγάδας',16,'Α','2026-05-01 06:38:03','2026-05-01 06:38:03'),(52,3,'Βένιος Αλέξανδρος Ιωάννης',17,'Α','2026-05-01 06:38:29','2026-05-01 06:38:29'),(53,3,'Μπισµπίκη Αθηνά',19,'Γ','2026-05-01 06:38:59','2026-05-01 06:38:59'),(54,3,'Μητσόπουλος Αναστάσης',24,'Α','2026-05-01 06:39:51','2026-05-01 06:39:51'),(55,3,'Μάρκου Μαρία',28,'Γ','2026-05-01 06:40:15','2026-05-01 06:40:15'),(56,1,'Μεθενίτη Πηγή Άννα',94,'Γ','2026-05-04 09:35:07','2026-05-04 09:35:07'),(57,5,'ΑΔΑΜΟΠΟΥΛΟΥ ΜΑΡΙΑ',13,'Γ','2026-05-04 11:48:33','2026-05-04 11:50:01'),(58,5,'ΛΟΥΡΩΤΟΥ ΡΕΑ',5,'Γ','2026-05-04 11:49:22','2026-05-04 11:49:47'),(59,5,'ΞΥΔΩΝΑ ΕΣΤΑ',7,'Γ','2026-05-04 11:50:26','2026-05-04 11:50:26'),(60,5,'ΚΟΥΤΣΟΔΟΝΤΗΣ ΝΙΚΟΣ',41,'Α','2026-05-04 11:50:42','2026-05-04 11:50:42'),(61,5,'ΧΑΣΑΠΗ ΛΙΝΑ',36,'Γ','2026-05-04 11:50:57','2026-05-04 11:50:57'),(62,5,'ΜΙΧΑΗΛΑΤΣΟΣ ΘΕΟΔΩΡΟΣ',22,'Α','2026-05-04 11:51:27','2026-05-04 11:51:27'),(63,5,'ΛΥΔΙΟΣ ΒΑΣΙΛΗΣ',99,'Α','2026-05-04 11:52:16','2026-05-04 11:52:16'),(64,5,'ΓΙΑΝΝΟΠΟΥΛΟΣ ΘΕΜΙΣΤΟΚΛΗΣ',10,'Α','2026-05-04 11:52:37','2026-05-04 11:52:37'),(65,5,'ΠΑΝΑΓΟΣ ΒΑΣΙΛΗΣ',21,'Α','2026-05-04 11:52:52','2026-05-04 11:52:52'),(66,5,'ΣΤΑΜΑΤΟΠΟΥΛΟΣ ΣΤΑΥΡΟΣ',11,'Α','2026-05-04 11:53:08','2026-05-04 11:53:08'),(68,5,'ΤΡΥΦΩΝ ΣΠΥΡΟΣ',24,'Α','2026-05-04 11:57:28','2026-05-04 11:57:28'),(69,5,'ΦΩΣΤΗΡΟΠΟΥΛΟΣ ΓΙΑΝΝΗΣ',15,'Α','2026-05-04 11:57:44','2026-05-04 11:57:44'),(70,5,'ΜΗΛΙΑΣ ΓΙΩΡΓΟΣ',9,'Α','2026-05-04 11:58:03','2026-05-04 11:58:03'),(71,6,'Γεωργιάδης  Τόλης',7,'Α','2026-05-05 07:57:34','2026-05-05 07:57:34'),(72,6,'Αντωνάκη Δάφνη',11,'Γ','2026-05-05 07:57:59','2026-05-05 07:57:59'),(73,6,'Γέρμανου Ιωάννα',10,'Γ','2026-05-05 07:58:18','2026-05-05 07:58:18'),(74,6,'Αντωνάκη Κλειώ',3,'Γ','2026-05-05 07:58:46','2026-05-05 07:58:46'),(75,6,'Χατζηνάκος Κώστας',22,'Α','2026-05-05 07:59:00','2026-05-05 07:59:00'),(76,6,'Γιαννέλος Μάριος',9,'Α','2026-05-05 07:59:30','2026-05-05 07:59:30'),(77,6,'Επιτροπάκης Θάνος',13,'Α','2026-05-05 07:59:51','2026-05-05 07:59:51'),(78,6,'Καλύβα Σωτηρία',6,'Γ','2026-05-05 08:00:03','2026-05-05 08:00:03'),(79,6,'Ρηγόπουλος Ρήγας',21,'Α','2026-05-06 12:02:14','2026-05-06 12:02:14'),(80,7,'Μιλένα Ζιβογίνοβιτς',1,'Γ','2026-05-07 08:33:10','2026-05-07 08:33:10'),(81,7,'Τζίνα Δηλέ',4,'Γ','2026-05-07 08:33:21','2026-05-07 08:33:21'),(82,7,'Ντανιέλα Γκίκα',6,'Γ','2026-05-07 08:33:31','2026-05-07 08:33:31'),(83,7,'Κώστας Φλέγκας',10,'Α','2026-05-07 08:33:46','2026-05-07 08:33:46'),(84,7,'Γιώργος Παντελούκας',12,'Α','2026-05-07 08:34:02','2026-05-07 08:34:02'),(85,7,'Πέτρος Σφακιανάκης',13,'Α','2026-05-07 08:34:24','2026-05-07 08:34:24'),(86,7,'Κική Πρέκα',14,'Γ','2026-05-07 08:34:36','2026-05-07 08:34:36'),(87,7,'Πέτρος Μαχαίρας',15,'Α','2026-05-07 08:34:48','2026-05-07 08:34:48'),(88,7,'Βίκυ Ριζάκη',16,'Γ','2026-05-07 08:34:59','2026-05-07 08:34:59'),(89,7,'Ανδρέας Κατσάρας',17,'Α','2026-05-07 08:35:09','2026-05-07 08:35:09'),(90,7,'Γιώργος Λαμπρόπουλος',47,'Α','2026-05-07 08:35:25','2026-05-07 08:35:25'),(91,7,'Μαρία Αραχωβίτη',97,'Γ','2026-05-07 08:35:37','2026-05-07 08:35:37'),(92,7,'Κώστας Μπουρνάζος',99,'Α','2026-05-07 08:35:50','2026-05-07 08:35:50'),(93,8,'Λασκας Αλέξανδρος',1,'Α','2026-05-07 12:48:45','2026-05-07 12:48:45'),(94,8,'Κωνσταντάς Χρυσάφης',2,'Α','2026-05-07 12:48:58','2026-05-07 12:48:58'),(95,8,'Σαρακατσιάνος Δημήτρης',3,'Α','2026-05-07 12:49:07','2026-05-07 12:49:07'),(96,8,'Δημόπουλος Δημήτρης',4,'Α','2026-05-07 12:49:15','2026-05-07 12:49:15'),(97,8,'Πεπόνης Χάρης',5,'Α','2026-05-07 12:49:23','2026-05-07 12:49:23'),(98,8,'Βουζίκη Κατερίνα',6,'Γ','2026-05-07 12:49:32','2026-05-07 12:49:32'),(99,8,'Ευσταθίου Ελένη',7,'Γ','2026-05-07 12:49:56','2026-05-07 12:49:56'),(100,8,'Μηνανάκη Χριστίνα',8,'Γ','2026-05-07 12:50:06','2026-05-07 12:50:06'),(101,8,'Γκαιδατζή Ευρυδίκη',9,'Γ','2026-05-07 12:50:15','2026-05-07 12:50:15'),(102,8,'Καφετζηδάκη Πηνελόπη',10,'Γ','2026-05-07 12:50:27','2026-05-07 12:50:27'),(103,9,'Κωνσταντίνος Κουτσουράδης',13,'Α','2026-05-07 12:59:58','2026-05-07 12:59:58'),(104,9,'Αντώνης Πεκιάς',22,'Α','2026-05-07 13:00:08','2026-05-07 13:00:08'),(105,9,'Νίκος Αγγέλου',7,'Α','2026-05-07 13:00:17','2026-05-07 13:00:17'),(106,9,'Βασίλης Αποστόλου',8,'Α','2026-05-07 13:00:42','2026-05-07 13:00:42'),(107,9,'Παντελής Αλασώνας',6,'Α','2026-05-07 13:01:02','2026-05-07 13:01:02'),(108,9,'Βασιλική Ντακα',10,'Γ','2026-05-07 13:01:15','2026-05-07 13:01:15'),(109,9,'Μαίρη Λάμπρου',26,'Γ','2026-05-07 13:01:29','2026-05-07 13:01:29'),(110,9,'Μαρίζα Μπούρα',14,'Γ','2026-05-07 13:01:45','2026-05-07 13:01:45'),(111,9,'Βάσια Γκίκα',11,'Γ','2026-05-07 13:02:01','2026-05-07 13:02:01'),(112,10,'Αυθίνου Κωνσταντίνα',1,'Γ','2026-05-08 09:56:41','2026-05-08 11:14:14'),(113,10,'Πολύζος Γιώργος',2,'Α','2026-05-08 09:56:58','2026-05-08 09:56:58'),(114,10,'Ξενάριος Γιώργος',3,'Α','2026-05-08 09:57:08','2026-05-08 09:57:08'),(115,10,'Μαρίνης Σωτήρης',4,'Γ','2026-05-08 09:57:19','2026-05-08 09:57:19'),(116,10,'Αυθίνου Ελένη',5,'Γ','2026-05-08 09:57:32','2026-05-08 09:57:32'),(117,10,'Σημαιοφορίδης Παναγιώτης',6,'Α','2026-05-08 09:57:44','2026-05-08 09:57:44'),(118,10,'Πνευματικού Ιωάννα',7,'Γ','2026-05-08 09:57:56','2026-05-08 09:57:56'),(120,10,'Ιακωβίδης Γιώργος',9,'Α','2026-05-08 09:58:20','2026-05-08 09:58:20'),(121,10,'Παπαδήμας Παναγιώτης',8,'Α','2026-05-08 10:33:20','2026-05-08 11:14:37'),(122,10,'Ξαγοράρη Ευαγγελία',10,'Γ','2026-05-08 10:33:38','2026-05-08 10:33:38');
/*!40000 ALTER TABLE `players` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `teams`
--

DROP TABLE IF EXISTS `teams`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teams` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `group` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `logo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teams`
--

LOCK TABLES `teams` WRITE;
/*!40000 ALTER TABLE `teams` DISABLE KEYS */;
INSERT INTO `teams` VALUES (1,'Α.Ο. Μαρκόπουλο 2',NULL,'teams/logos/OyWfi0ciXm57Y1dI6b2BsU3aqLU181dYF0T01e4q.png',NULL,'2026-04-28 13:13:53','2026-04-28 13:16:15'),(2,'Α.Ο. Μαρκόπουλο 1',NULL,'teams/logos/AaIh5dL6ACfd9l0gedv8XWKBjSQHUaUyUgCWTAHP.png','teams/photos/YBbYeTolZHfoTb6DK3xvQwB7OwQkiLjUvsr9PPmA.jpg','2026-04-28 13:21:09','2026-05-07 13:10:39'),(3,'Α.Στε.Γοι.',NULL,'teams/logos/6Fcibz9wBL9uCfPRTrEnAIl7u1QZyt83dKhytTvW.png','teams/photos/fTuZKp7A3FFw6hBH8cYgyFU0PvmcsVd0Lg52fFvo.jpg','2026-04-30 11:25:58','2026-04-30 11:27:20'),(4,'Volley Maniacs',NULL,'teams/logos/AtltaKXZydrZUjl3CWXjpDELjVx71QwLYUUwm6NU.png','teams/photos/5ISgBjwdv8jgHOEjnrylDlOnVjzwuJtztpe4TK7l.jpg','2026-04-30 13:07:06','2026-04-30 13:07:44'),(5,'Φαληρέας',NULL,'teams/logos/nK3EWVvFWxFCZZnNTCMTc36oYyF0eKZr9lNjNruT.png','teams/photos/sZFyfMSIZQZw0C5OeSB7ZeJDNXpHIG1oDyPJ2rII.jpg','2026-05-04 11:43:48','2026-05-05 08:14:44'),(6,'Τιτάνες',NULL,'teams/logos/nxOTdcVugG3U1GNglccfFpwhwlEg5lYO6cU2SDkh.png','teams/photos/NIZonv4Wcc7TQipyQE9eS2G6crIzjYtg8Nh7lVTp.jpg','2026-05-05 07:55:36','2026-05-05 07:57:08'),(7,'Α.ΚΕ.Ζωγράφου',NULL,'teams/logos/8R4xP6ESWqgM1Zw0Ho8i27cvBep5KaKAYbmpD6TP.jpg','teams/photos/5FQuKtOKjDZlHW6ORchTGvWhe9FiNYKb9DyCe0B8.jpg','2026-05-07 08:26:34','2026-05-07 08:32:42'),(8,'Ένωση Γαλατσίου',NULL,'teams/logos/MCIUdanlaR1knxOt1b5F0M7uz6lbQI0tr9edwXuZ.png',NULL,'2026-05-07 12:45:54','2026-05-07 12:48:27'),(9,'Sharks',NULL,'teams/logos/0G0PgTNDng3nxLpZTjmnZeuA3TbB0Tr3spvhnEan.jpg',NULL,'2026-05-07 12:59:22','2026-05-07 12:59:40'),(10,'Α Α Σ Κερατσινιού Δραπετσώνας - Κότινος',NULL,'teams/logos/hhAzUJkFroM4gi2qHHRPUMjLET6bTXpIcRqB1tv6.png',NULL,'2026-05-08 09:44:20','2026-05-08 09:47:13');
/*!40000 ALTER TABLE `teams` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-08 11:17:21
